var data1 = [{
    "姓名": "余夏",
    "年龄": 29,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "豆豆",
    "年龄": 25,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "帅常荣",
    "年龄": 26,
    "长相": "帅",
    "体型": "胖",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "王涛",
    "年龄": 22,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "李东",
    "年龄": 23,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "王五五",
    "年龄": 23,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "见"
  },
  {
    "姓名": "王小涛",
    "年龄": 22,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "见"
  },
  {
    "姓名": "李缤",
    "年龄": 21,
    "长相": "帅",
    "体型": "胖",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "刘明",
    "年龄": 21,
    "长相": "帅",
    "体型": "胖",
    "收入": "低",
    见面: "不见"
  },
  {
    "姓名": "红鹤",
    "年龄": 21,
    "长相": "不帅",
    "体型": "胖",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "李理",
    "年龄": 32,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "周州",
    "年龄": 31,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "李乐",
    "年龄": 27,
    "长相": "不帅",
    "体型": "胖",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "韩明",
    "年龄": 24,
    "长相": "不帅",
    "体型": "瘦",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "小吕",
    "年龄": 28,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "不见"
  },
  {
    "姓名": "李四",
    "年龄": 25,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "不见"
  },
  {
    "姓名": "王鹏",
    "年龄": 30,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "不见"
  },
];
var data2 = [{
    "姓名": "余",
    "年龄": 29,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "豆",
    "年龄": 25,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "帅常",
    "年龄": 26,
    "长相": "帅",
    "体型": "胖",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "王",
    "年龄": 22,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "李",
    "年龄": 23,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "王五",
    "年龄": 23,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "见"
  },
  {
    "姓名": "王小",
    "年龄": 22,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "见"
  },
  {
    "姓名": "李",
    "年龄": 21,
    "长相": "帅",
    "体型": "胖",
    "收入": "高",
    见面: "见"
  },
  {
    "姓名": "刘",
    "年龄": 21,
    "长相": "帅",
    "体型": "胖",
    "收入": "低",
    见面: "不见"
  },
  {
    "姓名": "红",
    "年龄": 21,
    "长相": "不帅",
    "体型": "胖",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "李理",
    "年龄": 32,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "周",
    "年龄": 31,
    "长相": "帅",
    "体型": "瘦",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "杨乐",
    "年龄": 27,
    "长相": "不帅",
    "体型": "胖",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "小明",
    "年龄": 24,
    "长相": "不帅",
    "体型": "瘦",
    "收入": "高",
    见面: "不见"
  },
  {
    "姓名": "大吕",
    "年龄": 28,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "不见"
  },
  {
    "姓名": "李四",
    "年龄": 25,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "不见"
  },
  {
    "姓名": "王鹏",
    "年龄": 30,
    "长相": "帅",
    "体型": "瘦",
    "收入": "低",
    见面: "不见"
  },
];
var data = [...data1, ...data2];

function Unique(data) {
  let res = [];
  let map = new Map();
  let id = 0;
  res = data.filter((item) => {
    id++;
    if (!map.has(item['姓名'])) {
      map.set(item['姓名'], id);
      return true
    } else return false;
  })
  return res;
}
let res = Unique(data);
exports.data = res;